turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cp/atdf/ATSAM4CP16C_1.atdf
        <register caption="Interrupt Enable Register" name="AES_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00000002" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00000008" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000010" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
        </register>
        <register caption="Interrupt Disable Register" name="AES_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00000002" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00000008" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00000010" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Disable" mask="0x00000100" name="URAD"/>
        </register>
        <register caption="Interrupt Mask Register" name="AES_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x00000002" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00000008" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00000010" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Mask" mask="0x00000100" name="URAD"/>
        </register>
        <register caption="Interrupt Status Register" name="AES_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of RX Buffer" mask="0x00000002" name="ENDRX"/>
          <bitfield caption="End of TX Buffer" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="RX Buffer Full" mask="0x00000008" name="RXBUFF"/>
          <bitfield caption="TX Buffer Empty" mask="0x00000010" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Status" mask="0x00000100" name="URAD"/>
          <bitfield caption="Unspecified Register Access:" mask="0x0000F000" name="URAT" values="AES_ISR__URAT"/>
          <bitfield caption="GCM Tag Ready" mask="0x00010000" name="TAGRDY"/>
        </register>
        <register caption="Key Word Register 0" name="AES_KEYWR0" offset="0x20" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 1" name="AES_KEYWR1" offset="0x24" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 2" name="AES_KEYWR2" offset="0x28" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 3" name="AES_KEYWR3" offset="0x2C" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 4" name="AES_KEYWR4" offset="0x30" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 5" name="AES_KEYWR5" offset="0x34" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 6" name="AES_KEYWR6" offset="0x38" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Key Word Register 7" name="AES_KEYWR7" offset="0x3C" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Input Data Register 0" name="AES_IDATAR0" offset="0x40" rw="W" size="4">
          <bitfield caption="Input Data Word" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data Register 1" name="AES_IDATAR1" offset="0x44" rw="W" size="4">
          <bitfield caption="Input Data Word" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data Register 2" name="AES_IDATAR2" offset="0x48" rw="W" size="4">
          <bitfield caption="Input Data Word" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Input Data Register 3" name="AES_IDATAR3" offset="0x4C" rw="W" size="4">
          <bitfield caption="Input Data Word" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Output Data Register 0" name="AES_ODATAR0" offset="0x50" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Output Data Register 1" name="AES_ODATAR1" offset="0x54" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Output Data Register 2" name="AES_ODATAR2" offset="0x58" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Output Data Register 3" name="AES_ODATAR3" offset="0x5C" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Initialization Vector Register 0" name="AES_IVR0" offset="0x60" rw="W" size="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
