turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cp/atdf/ATSAM4CP16C_1.atdf
      <value-group caption="" name="SUPC_MR__ONREG">
        <value caption="Internal voltage regulator is not used (external power supply is used)." name="ONREG_UNUSED" value="0"/>
        <value caption="Internal voltage regulator is used." name="ONREG_USED" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BUPPOREN">
        <value caption="Disables the backup POR." name="BUPPOR_DISABLE" value="0"/>
        <value caption="Enables the backup POR." name="BUPPOR_ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__OSCBYPASS">
        <value caption="No effect. Clock selection depends on XTALSEL value." name="NO_EFFECT" value="0"/>
        <value caption="The 32 kHz crystal oscillator is selected and put in bypass mode." name="BYPASS" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__FWUPEN">
        <value caption="The force wake-up pin has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="The force wake-up pin low forces a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__SMEN">
        <value caption="The supply monitor detection has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="The supply monitor detection forces a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__RTTEN">
        <value caption="The RTT alarm signal has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="The RTT alarm signal forces a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__RTCEN">
        <value caption="The RTC alarm signal has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="The RTC alarm signal forces a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCEN0">
        <value caption="The WKUP0/TMP0 input pin is not connected to the low-power debouncer." name="NOT_ENABLE" value="0"/>
        <value caption="The WKUP0/TMP0 input pin is connected to the low-power debouncer and can force a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCEN1">
        <value caption="The WKUP10/TMP1 input pin is not connected to the low-power debouncer." name="NOT_ENABLE" value="0"/>
        <value caption="The WKUP10/TMP1 input pin is connected to the low-power debouncer and can force a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCCLR">
        <value caption="A low-power debounce event does not create an immediate clear on the first half of GPBR registers." name="NOT_ENABLE" value="0"/>
        <value caption="A low-power debounce event on WKUP0/TMP0 or WKUP10/14/15/TMP1/2/3 (if DISTMPCLR1/2/3 is cleared) generates an immediate clear on the first half of GPBR registers." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__FWUPDBC">
        <value caption="Immediate, no debouncing, detected active at least on one Slow Clock edge." name="IMMEDIATE" value="0x0"/>
        <value caption="FWUP shall be low for at least 3 SLCK periods" name="_3_SCLK" value="0x1"/>
        <value caption="FWUP shall be low for at least 32 SLCK periods" name="_32_SCLK" value="0x2"/>
        <value caption="FWUP shall be low for at least 512 SLCK periods" name="_512_SCLK" value="0x3"/>
        <value caption="FWUP shall be low for at least 4,096 SLCK periods" name="_4096_SCLK" value="0x4"/>
        <value caption="FWUP shall be low for at least 32,768 SLCK periods" name="_32768_SCLK" value="0x5"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__WKUPDBC">
        <value caption="Immediate, no debouncing, detected active at least on one Slow Clock edge." name="IMMEDIATE" value="0x0"/>
        <value caption="WKUPx shall be in its active state for at least 3 SLCK periods" name="_3_SCLK" value="0x1"/>
        <value caption="WKUPx shall be in its active state for at least 32 SLCK periods" name="_32_SCLK" value="0x2"/>
        <value caption="WKUPx shall be in its active state for at least 512 SLCK periods" name="_512_SCLK" value="0x3"/>
        <value caption="WKUPx shall be in its active state for at least 4,096 SLCK periods" name="_4096_SCLK" value="0x4"/>
        <value caption="WKUPx shall be in its active state for at least 32,768 SLCK periods" name="_32768_SCLK" value="0x5"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBC">
        <value caption="Disable the low-power debouncers." name="DISABLE" value="0x0"/>
        <value caption="WKUP0/10/14/15/TMP0/1/2/3 in active state for at least 2 RTCOUT0 periods" name="_2_RTCOUT0" value="0x1"/>
        <value caption="WKUP0/10/14/15/TMP0/1/2/3 in active state for at least 3 RTCOUT0 periods" name="_3_RTCOUT0" value="0x2"/>
        <value caption="WKUP0/10/14/15/TMP0/1/2/3 in active state for at least 4 RTCOUT0 periods" name="_4_RTCOUT0" value="0x3"/>
        <value caption="WKUP0/10/14/15/TMP0/1/2/3 in active state for at least 5 RTCOUT0 periods" name="_5_RTCOUT0" value="0x4"/>
        <value caption="WKUP0/10/14/15/TMP0/1/2/3 in active state for at least 6 RTCOUT0 periods" name="_6_RTCOUT0" value="0x5"/>
        <value caption="WKUP0/10/14/15/TMP0/1/2/3 in active state for at least 7 RTCOUT0 periods" name="_7_RTCOUT0" value="0x6"/>
        <value caption="WKUP0/10/14/15/TMP0/1/2/3 in active state for at least 8 RTCOUT0 periods" name="_8_RTCOUT0" value="0x7"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCEN2">
        <value caption="The WKUP14/TMP2 input pin is not connected to the low-power debouncer." name="NOT_ENABLE" value="0"/>
        <value caption="The WKUP14/TMP2 input pin is connected to the low-power debouncer and can force a system wake-up." name="ENABLE" value="1"/>
      </value-group>
